[
    {
        "title": "DBS CEO Piyush Gupta thinks work-life balance is 'baloney' & that work is part of life",
        "link": "https://www.reddit.com/r/singapore/comments/15cplk9/dbs_ceo_piyush_gupta_thinks_worklife_balance_is/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": [
            {
                "body": "Is this what DBS means by its slogan \"Bank Less, 'Live' More\"?",
                "sentiment": 0.15656565656565657,
                "subjectivity": 0.35555555555555557
            },
            {
                "body": "It's much more palatable to make work a big part of your life when you're the CEO and you're being paid huge sums of money. \n\nFor 3k per month, I'm gonna just switch off from work on my off days. I have dishes to clean, laundry to do and my housework to finish. I can't afford to pay people to do all those things for me. I'd also like to finish all those necessary tasks faster so I have more time to bond with my kids.",
                "sentiment": 0.29444444444444445,
                "subjectivity": 0.6166666666666667
            },
            {
                "body": "Would like DBS CEO to offer to be paid 2.7k a month and spout the same inane bullshit.",
                "sentiment": 0.0,
                "subjectivity": 0.125
            },
            {
                "body": "[deleted]",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "Gen z got it right on this.. work is definitely not a part of life.. defining your life based on a job that you go to simply to make money is fucking sad",
                "sentiment": -0.053571428571428575,
                "subjectivity": 0.5982142857142857
            },
            {
                "body": "> \"your friends are there, your colleagues are there, your impact is there, your growth is there, your income is there\".\n\nOh poor little man. I feel so sorry for him. He may be rich financially, but he's a pauper in life.\nI have friends outside work, I find growth in areas outside work, I make an impact in non work things (eg volunteering, raising kids etc).\n\nI have a more diversified portfolio of life than the CEO of DBS himself, who seems to be all-in on one basket. That's bad diversification.",
                "sentiment": -0.10138888888888886,
                "subjectivity": 0.4574074074074074
            },
            {
                "body": "That might be the case in the older generation but good luck telling Gen Zs this. Your best employees will be headed out the door before you know it.",
                "sentiment": 0.6222222222222222,
                "subjectivity": 0.41111111111111115
            },
            {
                "body": "If I am earning 200m a year I'mma able to say this bullshit.\n\nJust like Jack Ma saying \"I don't like money, I don't care about money\" few years back. \n\nHa ha ha.",
                "sentiment": 0.09999999999999999,
                "subjectivity": 0.24166666666666667
            },
            {
                "body": "If i was getting his pay, i would be enjoying every second of work lol. \nShouldve just kept this in the drafts chief.",
                "sentiment": 0.43333333333333335,
                "subjectivity": 0.4333333333333333
            },
            {
                "body": "I once worked at DBS hub at Changi and one memorable case was theres this one employee who broke down one day and started hurling furniture at management. Guy came back a week later and kept working like nothing happened.",
                "sentiment": 0.08611111111111111,
                "subjectivity": 0.32222222222222224
            }
        ]
    },
    {
        "title": "DBS’ Piyush Gupta calls for rethink on Singapore’s reserves",
        "link": "https://www.reddit.com/r/singapore/comments/15tdbbu/dbs_piyush_gupta_calls_for_rethink_on_singapores/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": [
            {
                "body": "**The downvote is not a disagree button.** Please help to upvote articles that you want to see more discussion on, and downvote those that you feel has little value on the sub.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
                "sentiment": 0.13749999999999998,
                "subjectivity": 0.3666666666666667
            },
            {
                "body": "Piyush: the government should enact stimulus via digital payment metho- ah fuck PayLah down again",
                "sentiment": -0.1851851851851852,
                "subjectivity": 0.2962962962962963
            },
            {
                "body": "He probably has plans to retire soon, so decided to just let loose lol",
                "sentiment": 0.3615384615384616,
                "subjectivity": 0.48461538461538456
            },
            {
                "body": "I don't disagree with him tbh, especially the bit about uplifting the \"underbelly\" of society. Personally I wish the gov could invest more in social services, especially mental health. Many Singaporeans are struggling mentally, experiencing loneliness, anxiety, depression etc, no doubt related to wider socioeconomic issues like rising cost of living, job insecurity etc.",
                "sentiment": 0.09166666666666666,
                "subjectivity": 0.42083333333333334
            },
            {
                "body": "He wants to tap on the reserves.",
                "sentiment": 0.2,
                "subjectivity": 0.1
            },
            {
                "body": "Private sector CEOs sure like to call government to spend and invest, throw in buzzwords like the underbelly of society to get support. Quite silent about their own compensation and their own company’s work life balance.\n\nWe are already using returns on our reserves to fund Govt spending, which includes welfare programs.\n\nWe invest in regional countries, but our small size makes us an easy target to makan. Our neighbours are known to take in investment money and do their own thing anyway.",
                "sentiment": 0.3104166666666667,
                "subjectivity": 0.6996527777777778
            },
            {
                "body": "He is one South Asian National that will have my respect for saying things straight to the face of Lawrence Wong in a public setting and now. He always leave no survivors.",
                "sentiment": 0.06666666666666667,
                "subjectivity": 0.15555555555555556
            },
            {
                "body": "Curious what motives he has? It could be completely altruistic and keen on helping the low income group but it doesn’t square with what I think of him. \n\nI do agree though. For a rich nation, we sure are shit at acting like it. Mental health all time low. Very limited help for mentally ill or special needs kids. Basically how most families live is by employing a domestic helper at super depressed prices else the family goes kaput.",
                "sentiment": 0.08181141774891776,
                "subjectivity": 0.5101686507936508
            },
            {
                "body": "For better or worse, Singapore smartly markets its reserves stability. For a banker of course if your local government unlocks more funds it means more cash-flow. But then again there’s a reason why ah gong LKY put all these guardrails, if you follow Singapore almost definitely won’t fail.\n\nTo be frank, I find recent statements from DBS CEO, quite terrible. I feel like their recent financial products no longer reflect it’s “everyday Singaporean” roots, and they just wanna YOLO like all these finbros.",
                "sentiment": -0.029670329670329672,
                "subjectivity": 0.434065934065934
            },
            {
                "body": "What is his point? We should spend our nation's hard earned savings?  Do I hear a whisper of \"fucking populist\"?",
                "sentiment": -0.4458333333333333,
                "subjectivity": 0.6708333333333334
            }
        ]
    },
    {
        "title": "4 of the 5 major DBS disruptions in 2023 were bug- or software-related: CEO Piyush Gupta",
        "link": "https://www.reddit.com/r/singapore/comments/17ph06j/4_of_the_5_major_dbs_disruptions_in_2023_were_bug/",
        "sentiment": 0.0625,
        "subjectivity": 0.5,
        "comments": [
            {
                "body": "> Asked whether the measures will affect business, Mr Gupta said the bank did not have new deals or business ventures planned, and has not reduced its branch or ATM network in recent years.\n\n\nSo no impact.",
                "sentiment": 0.06818181818181818,
                "subjectivity": 0.3522727272727273
            },
            {
                "body": "Blaming WFH, typical executive",
                "sentiment": -0.16666666666666666,
                "subjectivity": 0.5
            },
            {
                "body": "\"Mr Gupta said the bank did not have new deals or business ventures planned, and has not reduced its branch or ATM network in recent years.\"\n\nYa right... In my vicinity, one dbs branch closed and became scarlett. Another posb branch closed and became self service lobby.",
                "sentiment": 0.044415584415584415,
                "subjectivity": 0.28805194805194806
            },
            {
                "body": ">His takeaway from the trips was that we could be the “D” in GANDALF — a term we coined to refer to the likes of Google, Amazon, Netflix, Apple, LinkedIn and Facebook. So in running the company, we started to act less like a bank and more like a tech company, asking ourselves, “What would Jeff (Bezos) do?”\n\nhttps://www.dbs.com/media/features/at-dbs-we-act-less-like-a-bank-and-more-like-a-tech-company-with-dbs-bank-ceo-piyush-gupta.page\n\nWith such delusions of being a tech company, you would've thought they will be focusing on software quality, but noooo, it's cheaper to outsource it all to India or something. It's what Google and Meta do right? Outsource all their software development to cheap overseas contractors.",
                "sentiment": 0.2038095238095238,
                "subjectivity": 0.46047619047619043
            },
            {
                "body": "is this what gen z call it as \"delulu\"?",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "Wow blame the codes and software but not management or himself. But when profits soared it is due to management and him. Come we clap for you",
                "sentiment": -0.012499999999999997,
                "subjectivity": 0.6875
            },
            {
                "body": "Not sure if people here are aware… DBS is notorious for hiring non-CS grads and expats from a certain country for tech.",
                "sentiment": -0.017857142857142863,
                "subjectivity": 0.7301587301587301
            },
            {
                "body": "All the tech experts who left dbs are celebrating now",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "this totally sounds like spaghetti coding, especially for IT in banking industry. Their codes stem from legacy systems into even modern platforms but the problem is that coders come and go, and getting features out asap is top priority usually so lack of proper coding practises and testing etc. Probably even poor IT architecture planning and everyone just constantly build on top one another lol.\n\ni also think their BCP and DR testing was poorly executed, probably skipped steps to reduce their daily tasks. by right, once the BCP and DR plans kick in, the current systems should switch over to backup systems swiftly.\n\none fine day, the whole system or major parts of it will break, its just a matter of when and who are the unlucky ones to fix it lol.",
                "sentiment": 0.1508267195767196,
                "subjectivity": 0.4816137566137566
            },
            {
                "body": "Shuddup la. Still your responsibility to fix or prevent",
                "sentiment": 0.0,
                "subjectivity": 0.0
            }
        ]
    },
    {
        "title": "DBS CEO Piyush Gupta asks Lawrence Wong how to redefine success beyond material wealth within a short timeframe",
        "link": "https://www.reddit.com/r/singapore/comments/14a1z3o/dbs_ceo_piyush_gupta_asks_lawrence_wong_how_to/",
        "sentiment": 0.15,
        "subjectivity": 0.15,
        "comments": [
            {
                "body": "Youngsters these days all in tech jobs not because of prestige. But because that and finance seem to be one of the only good paying ones when everything is freaking going up.\n\nYou want your children to take up traditional roles like engineering and struggle to fight inflation meh. No parent of sane mind would support that for the sake of “different pathways”.\n\nOther countries have different pathways because they got unions to fight and guard the locals from foreign intervention. Here got no such thing. \n\nNot trying to be a wet blanket but simple words don’t do anything while status quo exists. It’s like talking to the fire and asking it to calm down.",
                "sentiment": 0.04120370370370371,
                "subjectivity": 0.5288359788359789
            },
            {
                "body": "This is a generational mindset placed upon the people by teachers and parents telling their kids how if they don't do well in school and get 'XYZ' high paying job, they will be a failure in life. Singaporeans care more about the money the job pays, than what the value of the work done.",
                "sentiment": 0.11444444444444442,
                "subjectivity": 0.4466666666666666
            },
            {
                "body": "You know you're successful when you can kopi talk in front of a crowd on stage.",
                "sentiment": 0.75,
                "subjectivity": 0.95
            },
            {
                "body": "Weaponised incompetence. Talk is cheap, and what he is proposing is incredibly idealistic. One of the things he proposes is that we compress the wage structure, I am guessing this means making pay across different industries similar while still upholding meritocracy by having clear progressions in these careers with pay bands clearly marked out. However with how “impressive” MOM has been with enforcing anything I highly doubt this to work.\n\nAnother thing is redefining success to something that is collective / derived from our own passions while ensuring basic needs are met. This just feels like some kind of escapism to me. Rather than solving pertinent issues like rising CoL, or the general lack of social mobility, we are told to shift the yardsticks about so that we can still feel good about ourselves.\n\nTo the hero that would ask me what would I propose then?\n- I am not paid 1 million a year to find that out\n- Admittedly, I have no good ideas either. I think the problem here is really just a maturing economy, global uncertainty and drying up of opportunities and there is no good short-term way to solve these issues without great foresight. We need a way to be competitive in globalisation and having a leader with foresight would help a lot. 🤷",
                "sentiment": 0.2621666666666667,
                "subjectivity": 0.52325
            },
            {
                "body": "TLDR: Lawrence Wong has no answer.\n\n\nblabber so much buzz words… \n\nsimi compress wage structure when his ministerial pay is pegged to top% earners. Why not the bottom/medium rung?\n\nTalk about basic wages when we don’t have basic minimum wage in Singapore.\n\n….\n\n\nI am not PM material but his answer definitely wasn’t PM material. 😬",
                "sentiment": 0.05,
                "subjectivity": 0.2375
            },
            {
                "body": "Lawrence wong be like :”Bro u earn ten times more than me… u tell me what is the definition of success”",
                "sentiment": 0.26666666666666666,
                "subjectivity": 0.16666666666666666
            },
            {
                "body": "The title makes it seem like Gupta fired shots at the DPM. I am interested to watch a video of the interaction but can't find any.\n\nCould also be the question and answer were already scripted for this event.",
                "sentiment": 0.25,
                "subjectivity": 0.5
            },
            {
                "body": "Two wealthy people taking cock about redefining success beyond material wealth...might want to look below the poverty line for that kind of info.",
                "sentiment": 0.4666666666666666,
                "subjectivity": 0.6333333333333333
            },
            {
                "body": "How dare piyush question the empire’s leader? Fire his sorry a$$ n let another lackey run dbs",
                "sentiment": -0.5,
                "subjectivity": 1.0
            },
            {
                "body": "It’s the second time, that I have seen, DPM fumble on this line of questioning. First instance being the youth forum, where he jokingly replied to a similar question on alternative paths to success with something along the lines of ‘just don’t compare results with your cousins at CNY’. \n\n\nThis is one of THE most important questions as we continue to transform as a society and economy. And he’s had 6 months since the youth forum to come up with a more considered response. However, his answer here still does NOT inspire confidence. Actually, the fact that he doesn’t nail this question each and every time is absolutely worrying. This guy is going to be our PM guys. Shudders.",
                "sentiment": 0.23888888888888893,
                "subjectivity": 0.4148148148148148
            }
        ]
    },
    {
        "title": "DBS CEO Piyush Gupta sells $3.4 million worth of shares in bank",
        "link": "https://www.reddit.com/r/singapore/comments/15l7esa/dbs_ceo_piyush_gupta_sells_34_million_worth_of/",
        "sentiment": 0.3,
        "subjectivity": 0.1,
        "comments": [
            {
                "body": "**The downvote is not a disagree button.** Please help to upvote articles that you want to see more discussion on, and downvote those that you feel has little value on the sub.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
                "sentiment": 0.13749999999999998,
                "subjectivity": 0.3666666666666667
            },
            {
                "body": "This is the guy who is laughing at people asking for work life balance right",
                "sentiment": 0.2857142857142857,
                "subjectivity": 0.5357142857142857
            },
            {
                "body": "That’s probably just one year’s worth of deferred stock comp for him. No biggie.",
                "sentiment": 0.3,
                "subjectivity": 0.1
            },
            {
                "body": "To put this in context, this is only 4.4% of his overall holdings",
                "sentiment": 0.0,
                "subjectivity": 0.5
            },
            {
                "body": "Just in time for 8/8 online sales, guy must be snapping up the bargains",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "He probably knows something other don’t. Quickly follow and sells too",
                "sentiment": 0.10416666666666666,
                "subjectivity": 0.4375
            },
            {
                "body": "Before ex date? Wah if I got that amount of stocks I won't need to work, can live off dividends le",
                "sentiment": 0.13636363636363635,
                "subjectivity": 0.5
            },
            {
                "body": "He needs some spare change",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "Were they baloney shares?",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "im dumb, but are ceos , no less, allowed to buy shares of their own company? where do you draw the line on insider trading?",
                "sentiment": 0.10277777777777776,
                "subjectivity": 0.5222222222222223
            }
        ]
    },
    {
        "title": "DBS CEO Piyush Gupta gets S$13.58 million 2021 salary, up 48%",
        "link": "https://www.reddit.com/r/singapore/comments/tb4vrx/dbs_ceo_piyush_gupta_gets_s1358_million_2021/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": [
            {
                "body": "Meanwhile my man Maguire getting £9.875m 🙌🏻",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "Dbs shareholders seeing the increase in profits and share price should be happy it him leading dbs",
                "sentiment": 0.8,
                "subjectivity": 1.0
            },
            {
                "body": "Don’t understand all these negative comments. He is being paid for his performance and yes, he did lead DBS to a record year. Not a DBS shareholder but this guy has transformed DBS to a leading bank in the REGION and deserves his pay. \n\nSo many salty people",
                "sentiment": 0.1,
                "subjectivity": 0.45
            },
            {
                "body": "> # DBS CEO Piyush Gupta gets S$13.58 million 2021 salary, up 48%\n\n> DBS Group Holdings CEO Piyush Gupta has received a 48 per cent pay rise for 2021, The Edge Singapore reported.\n\n> This was after he took a pay cut the year before.\n\n> The company’s annual report out on March 9 showed Gupta given a total package of S$13.58 million, of which, more than S$7.1 million was in shares.\n\n> The report called 2021 DBS's “best year ever” in terms of financial performance.\n\n> The DBS report said:\n\n> “With Covid-19 in the second year, global interest rates remained at rock-bottom levels. China idiosyncratic risks also increased, following moves by the government to temper exuberance in the property market. Against this backdrop, DBS’ sterling financial performance underlined the strength of our broad-based franchise and the success of multi-year transformation efforts.”\n\n> Against the backdrop of rock-bottom interest rate levels and increased China \"idiosyncratic\" risks, following moves by its government to temper property market exuberance, this \"achievement was all the more remarkable given ongoing challenges in the operating environment\", DBS added.\n\n> Bank earnings up\n\n> For the financial year that ended December, the bank reported record earnings of S$6.8 billion.\n\n> This was a 44 per cent increase year-on-year and 6 per cent above the previous high in 2019.\n\n> During the period, the bank saw a return on equity of 12.5 per cent, which is the second-highest in over a decade.\n\n> Took pay cut previously\n\n> Performance was not great for the year before in financial year 2020.\n\n> Gupta took a S$9.18 million salary, a pay cut of 24 per cent as a result of the pandemic.\n\n> Compared with before the pandemic hit, Gupta's pay increased 12 per cent from S$12.13 million in 2019.\n\n> Expanded to overseas market\n\n> Gupta also said in the annual report about how DBS needs to be more deeply embedded into the markets it already has a presence in, which include China, Taiwan, India and Indonesia, that are outside Singapore and Hong Kong.\n\n> DBS acquired Citigroup’s consumer banking business in Taiwan and bought a 13 per cent stake in Shenzhen Rural Commercial Bank in 2021, adding between $1.2 billion and $1.3 billion to its revenue base, Gupta said.\n\n> The amalgamation of Lakshmi Vilas Bank in India S$500 million to its bottom line, he added.\n\n> Focus on technology\n\n> Gupta said DBS will continue to focus on technology transformation.\n\n> Technology transformation has enabled DBS to switch to remote working without any loss of productivity during the pandemic, he said.\n\n> He also noted that DBS' early adoption of emerging technologies such as blockchain, artificial intelligence and the Internet of Things (IoT) has enabled them to help their customers navigate disruptions faced during the pandemic.\n\n> Top photo via\n\n> Follow and listen to our podcast here\n\n---\n1.0.2 | [Source code](https://github.com/fterh/sneakpeek) | [Contribute](https://github.com/fterh/sneakpeek)",
                "sentiment": 0.06922222222222223,
                "subjectivity": 0.30577777777777776
            },
            {
                "body": "I wonder how many hours he actually spends working on a daily or weekly basis?\n\nI dream about having such remunerations like most other people, but I can't imagine working the amount of hours that CEOs are reported to be working, and the stress involved in making decisions which have far-reaching implications for the organization and even the country.\n\nI'm lazy by nature and don't spend much, so having plenty of free time to chill is more valued to me than having more money.",
                "sentiment": 0.20227272727272727,
                "subjectivity": 0.4522727272727273
            },
            {
                "body": "Saw some nasty stuff being said in Twitter & Facebook going into xenophobia and mentioning CECA (a free-trade agreement to remove tariffs not a bloody freedom of movement agreement) for no good reason, even though he is a Singaporean",
                "sentiment": -0.31666666666666665,
                "subjectivity": 0.8333333333333334
            },
            {
                "body": "wHOs next? \n\nIm aCHING to know",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "Now publish OCBC CEO salary",
                "sentiment": 0.0,
                "subjectivity": 0.0
            },
            {
                "body": "I have no issues with a qualified, competent CEO getting compensated for doing a great job. \nI have a problem with incompetent people in similar positions getting similar compensation.",
                "sentiment": 0.19,
                "subjectivity": 0.5166666666666666
            },
            {
                "body": "Welcome to the salty spitoon, how salty are you?",
                "sentiment": 0.8,
                "subjectivity": 0.9
            }
        ]
    },
    {
        "title": "r/Piyush_Gupta_Gaming Lounge",
        "link": "https://www.reddit.com/r/Piyush_Gupta_Gaming/comments/16k1fj5/rpiyush_gupta_gaming_lounge/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": []
    },
    {
        "title": "Peds gupte or piyush gupta or snehal patel",
        "link": "https://www.reddit.com/r/indianmedschool/comments/159ywwp/peds_gupte_or_piyush_gupta_or_snehal_patel/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": []
    },
    {
        "title": "Singaporeans don’t deserve Piyush Gupta: \"Foreign talent\" and the decline of Singapore Inc",
        "link": "https://www.reddit.com/r/singapore/comments/ivm4fr/singaporeans_dont_deserve_piyush_gupta_foreign/",
        "sentiment": -0.125,
        "subjectivity": 0.125,
        "comments": [
            {
                "body": "Isn't the failure of the many Singapore Inc companies he talks about due to paper generals being parachuted in and all the cronyism and nepotism in the current administration?",
                "sentiment": 0.014583333333333323,
                "subjectivity": 0.39375000000000004
            },
            {
                "body": "I have a few questions.\n\nWho is willing to be transferred to work in India for a period of 3 years in order to build up your resume. Whether at middle management or higher levels? \n\nWhat is the country in question is Poland? And what if the country is Australia?\n\ncould you explain why for your choices?",
                "sentiment": 0.075,
                "subjectivity": 0.3375
            },
            {
                "body": "Essay is strikingly similar to the regular hand-wringing by the French as to why the grande écoles don't produce leaders in European institutions, but instead good-enough bureaucrats who manage French institutions to mediocrity. Not badly - just not greatly, either.\n\nAnswers in both cases are likely to be the same - the national education systems of both countries produce leaders who are comfortable in their home countries but uncomfortable regionally, and the phenomenon of brain drain into the civil service is a real one",
                "sentiment": -0.011538461538461544,
                "subjectivity": 0.40912228796844186
            },
            {
                "body": "The divisive and Indian supremacist undertone aside, he did bring up some pretty good points. I thought the points about the decline of SG GLCs and job losses, and lack of Singaporeans with global experience are pretty spot on and insightful.\n\nI know he was mainly addressing Leong Mun Wai's singling out of Piyush Gupta in parliament (which I personally thought was kind of overboard as well), but are the average Singaporean complaints really about FTs occupying the handful of C-level jobs? How many of those numerous mid-level jobs in IT and finance seriously require working experience across every continent to do? \n\nThat is the kind of strawman argument that proponents love to use to shut down any debate on the flaws and social issues created by the current policies. I believe in keeping Singapore open, and attracting FTs to supplement our workforce, but that does not mean every implementation or version of such policies is sound.",
                "sentiment": 0.1576073232323232,
                "subjectivity": 0.4951388888888891
            },
            {
                "body": "\"The Malays in Malaysia...feel marginalised in their own country\".\n\nWhat is the author smoking???",
                "sentiment": 0.6,
                "subjectivity": 1.0
            },
            {
                "body": "There are Singaporeans in leadership positions in many industries, even NYSE listed corps. Just because you don’t see them covered in the media or in the “sexy” FAANG sector does not mean they don’t exist. Not many advertise their nationality because 1) they have been based abroad for a long time 2) it does not even matter or cross their mind.",
                "sentiment": 0.14270833333333333,
                "subjectivity": 0.5145833333333333
            },
            {
                "body": "So I finally took the time and effort to try and decipher the article.\n\nTLDR: Chinese men are entitled and that’s bad for Singapore’s economy. We should welcome foreign CEOs because they can help push our economy along. Case in point is the failure of our TLCs and the Chinese men leading them. \n\nI think people need to read this and appreciate it for the limited perspective it’s on rather than trying to generalise it one way or the other. \n\nFirst, it’s not about the normal workforce. So throw all those notions out the window. It’s about C-suite executives.\n\nSecond, Singapore Chinese men are bad at being c-suite leaders but yet feel entitled. Actually I think this bit is a bad generalisation. I don’t think the man on the street walks around and thinks “wtf I should be DBS CEO. Why is that Piyush in charge?!?!?”. To argue some sort of bumiputra effect is a bit of a laugh because most, if not all, Chinese men in the private sector have had to work for their positions. \n\nThird, it’s really directed at the leadership in TLCs and government organisations. And from this perspective, I think he’s right. Long have we griped about scholars being parachuted into positions of power when they haven’t indicated they’re suitable. Look at the recent LTA issue for example or some other Singapore businesses that have failed badly. \n\nThis is where we need to do better. And by we, I mean the government. No more putting in people just because they were identified at an early age as a star performer and then moving them around from post to post to justify that. It should be performance driven rather than having massive group think at the upper echelons.\n\nEdit: still a really badly written article though, purely from a writing perspective. It’s like a stream of consciousness almost.",
                "sentiment": -0.06070645363408518,
                "subjectivity": 0.4087562656641604
            },
            {
                "body": "> Singapore has an amazing opportunity to demonstrate a world where the best people from the world’s three largest civilisations work harmoniously and bring out the best in each other. But the Singaporean Chinese is now the new “bumiputra”, grumbling, complaining and even demanding for a world that no longer looks like what he was promised in the brochures where only his children are the best at everything. Now they know what the Malays in Malaysia feel like, or the whites in the bible belt in the US, marginalised in their own countries.",
                "sentiment": 0.46792929292929286,
                "subjectivity": 0.5143939393939393
            },
            {
                "body": "Author is so salty that the website went down",
                "sentiment": -0.15555555555555559,
                "subjectivity": 0.2888888888888889
            },
            {
                "body": "wtf is Emmanuel Daniel smoking?",
                "sentiment": -0.5,
                "subjectivity": 1.0
            }
        ]
    },
    {
        "title": "DBS chief Piyush Gupta prefers accountability instead of running for cover",
        "link": "https://www.reddit.com/r/fanews/comments/14tlmbx/dbs_chief_piyush_gupta_prefers_accountability/",
        "sentiment": 0.0,
        "subjectivity": 0.0,
        "comments": []
    }
]